#!/usr/bin/env python3
import re

"""
    Встроенная функция input позволяет ожидать и возвращать данные из стандартного
    ввода ввиде строк (весь введенный пользователем текст до нажатия им enter).
    Используя данную функцию, напишите программу, которая:

    1. После запуска предлагает пользователю ввести целые неотрицательные числа,
    разделенные любым не цифровым литералом (пробел, запятая, %, буква и т.д.).
    2. Получив вводные данные, выделяет полученные числа, суммирует их,
    и печатает полученную сумму.

    Например:

    -> 12 12 12
    36

    -> 123dfgdr%0&45ty-45--900
    -777
"""

def main():
    input_str = input("> ")
    res = [int(x) for x in re.findall('[-]?[0-9]+',input_str)]
    print(sum(res))

if __name__ == "__main__":
    main()
